## Устанавливаем необходимые библиотеки SQL для работы в JN

Устанавливаем MySQL https://dev.mysql.com/downloads/installer/

Устанавливаем необходимые библиотеки:

In [1]:
# !pip install pymysql  # не надо
# !pip install ipython-sql
# !pip install mysqlclient
# !pip install mysql-connector-python  # не надо
# !pip install sqlalchemy

Устанавливаем соединениес MySQL:

In [1]:
import sqlalchemy

In [2]:
sqlalchemy.create_engine("mysql://root:123qwe@localhost/mydb")

Engine(mysql://root:***@localhost/mydb)

In [3]:
%load_ext sql

In [4]:
%sql mysql://root:123qwe@localhost/mydb

## Актуализируем таблицы для заданий п. 2.3:

In [6]:
%%sql
SELECT * FROM author;

 * mysql://root:***@localhost/mydb
5 rows affected.

[(1, 'Булгаков М.А.'),
 (2, 'Достоевский Ф.М.'),
 (3, 'Есенин С.А.'),
 (4, 'Пастернак Б.Л.'),
 (5, 'Лермонтов М.Ю.')]

In [7]:
%%sql
SELECT * FROM genre;

 * mysql://root:***@localhost/mydb
3 rows affected.

[(1, 'Роман'), (2, 'Поэзия'), (3, 'Приключения')]

In [8]:
%%sql
SELECT * FROM book;

 * mysql://root:***@localhost/mydb
8 rows affected.

[(1, 'Мастер и Маргарита', 1, 1, Decimal('670.99'), 3),
 (2, 'Белая гвардия', 1, 1, Decimal('540.50'), 5),
 (3, 'Идиот', 2, 1, Decimal('460.00'), 10),
 (4, 'Братья Карамазовы', 2, 1, Decimal('799.01'), 3),
 (5, 'Игрок', 2, 1, Decimal('480.50'), 10),
 (6, 'Стихотворения и поэмы', 3, 2, Decimal('650.00'), 15),
 (7, 'Черный человек', 3, 2, Decimal('570.20'), 6),
 (8, 'Лирика', 4, 2, Decimal('518.99'), 2)]

In [10]:
%%sql
DROP TABLE IF EXISTS supply CASCADE;

CREATE TABLE supply (
    supply_id INT PRIMARY KEY AUTO_INCREMENT,
    title VARCHAR(50),
    author VARCHAR(30),
    price DECIMAL(8,2),
    amount INT
);

INSERT INTO
    supply (title, author, price, amount)
VALUES
    ('Доктор Живаго', 'Пастернак Б.Л.', 618.99, 3),
    ('Черный человек', 'Есенин С.А.', 570.20, 6),
    ('Белая гвардия', 'Булгаков М.А.', 540.50, 7),
    ('Идиот', 'Достоевский Ф.М.', 360.80, 3),
    ('Стихотворения и поэмы', 'Лермонтов М.Ю.', 255.90, 4),
    ('Остров сокровищ', 'Стивенсон Р.Л.', 599.99, 5);

SELECT * FROM supply;

 * mysql://root:***@localhost/mydb
0 rows affected.
0 rows affected.
6 rows affected.
6 rows affected.

[(1, 'Доктор Живаго', 'Пастернак Б.Л.', Decimal('618.99'), 3),
 (2, 'Черный человек', 'Есенин С.А.', Decimal('570.20'), 6),
 (3, 'Белая гвардия', 'Булгаков М.А.', Decimal('540.50'), 7),
 (4, 'Идиот', 'Достоевский Ф.М.', Decimal('360.80'), 3),
 (5, 'Стихотворения и поэмы', 'Лермонтов М.Ю.', Decimal('255.90'), 4),
 (6, 'Остров сокровищ', 'Стивенсон Р.Л.', Decimal('599.99'), 5)]

## 2.3.2 Запросы на обновление, связанные таблицы

Для книг, которые уже есть на складе (в таблице **book**), но по другой цене, чем в поставке (**supply**),  необходимо в таблице **book** увеличить количество на значение, указанное в поставке,  и пересчитать цену. А в таблице **supply** обнулить количество этих книг. Формула для пересчета цены:

$$price={(p_1*k_1+p_2*k_2)\over k_1+k_2}$$  
где p1, p2 - цена книги в таблицах **book** и **supply**;  
    k1, k2 - количество книг в таблицах **book** и **supply**.

**Пояснение:** Пересчитываться должна цена только одной книги Достоевского «Идиот», для этой же книги увеличится количество в таблице **book** и обнулится количество в таблице **supply**.

In [5]:
%%sql
UPDATE book b
    INNER JOIN author a 
    USING(author_id)
    INNER JOIN supply s 
    ON b.title = s.title 
    AND s.author = a.name_author
SET 
    b.price = (b.price * b.amount + s.price * s.amount) / (b.amount + s.amount),
    b.amount = b.amount + s.amount,
    s.amount = 0   
WHERE
    b.price <> s.price;

SELECT * FROM supply;

 * mysql://root:***@localhost/mydb
2 rows affected.
8 rows affected.
6 rows affected.

[(1, 'Доктор Живаго', 'Пастернак Б.Л.', Decimal('618.99'), 3),
 (2, 'Черный человек', 'Есенин С.А.', Decimal('570.20'), 6),
 (3, 'Белая гвардия', 'Булгаков М.А.', Decimal('540.50'), 7),
 (4, 'Идиот', 'Достоевский Ф.М.', Decimal('360.80'), 0),
 (5, 'Стихотворения и поэмы', 'Лермонтов М.Ю.', Decimal('255.90'), 4),
 (6, 'Остров сокровищ', 'Стивенсон Р.Л.', Decimal('599.99'), 5)]

In [6]:
%%sql
SELECT * FROM book;

 * mysql://root:***@localhost/mydb
8 rows affected.

[(1, 'Мастер и Маргарита', 1, 1, Decimal('670.99'), 3),
 (2, 'Белая гвардия', 1, 1, Decimal('540.50'), 5),
 (3, 'Идиот', 2, 1, Decimal('437.11'), 13),
 (4, 'Братья Карамазовы', 2, 1, Decimal('799.01'), 3),
 (5, 'Игрок', 2, 1, Decimal('480.50'), 10),
 (6, 'Стихотворения и поэмы', 3, 2, Decimal('650.00'), 15),
 (7, 'Черный человек', 3, 2, Decimal('570.20'), 6),
 (8, 'Лирика', 4, 2, Decimal('518.99'), 2)]

## 2.3.3 Запросы на добавление, связанные таблицы

Откатываем изменения в таблицы **book** и **supply**.

In [8]:
%%sql
UPDATE book
SET price = 460.00, amount = 10
WHERE book_id = 3;

UPDATE supply
SET amount = 3
WHERE supply_id = 4;

 * mysql://root:***@localhost/mydb
1 rows affected.
1 rows affected.

[]

Включить новых авторов в таблицу **author** с помощью запроса на добавление, а затем вывести все данные из таблицы **author**.  Новыми считаются авторы, которые есть в таблице **supply**, но нет в таблице **author**.

In [9]:
%%sql
INSERT INTO
    author
SELECT
    author.name_author,
    supply.author
FROM
    author RIGHT JOIN supply
    ON author.name_author = supply.author
WHERE
    author.name_author IS Null;

SELECT * FROM author;

 * mysql://root:***@localhost/mydb
1 rows affected.
6 rows affected.

[(1, 'Булгаков М.А.'),
 (2, 'Достоевский Ф.М.'),
 (3, 'Есенин С.А.'),
 (4, 'Пастернак Б.Л.'),
 (5, 'Лермонтов М.Ю.'),
 (6, 'Стивенсон Р.Л.')]

Вариант без JOIN:
```mysql
INSERT INTO author(name_author)
SELECT DISTINCT author
FROM supply
WHERE author NOT IN (SELECT DISTINCT name_author FROM author);
```

## 2.3.4 Запрос на добавление, связанные таблицы

Актуализируем таблицы **book** и **supply**.

In [14]:
%%sql
UPDATE book
SET amount = 12
WHERE book_id = 2;

UPDATE book
SET price = 437.11, amount = 13
WHERE book_id = 3;

UPDATE book
SET amount = 12
WHERE book_id = 7;

SELECT * FROM book;

 * mysql://root:***@localhost/mydb
1 rows affected.
1 rows affected.
1 rows affected.
8 rows affected.

[(1, 'Мастер и Маргарита', 1, 1, Decimal('670.99'), 3),
 (2, 'Белая гвардия', 1, 1, Decimal('540.50'), 12),
 (3, 'Идиот', 2, 1, Decimal('437.11'), 13),
 (4, 'Братья Карамазовы', 2, 1, Decimal('799.01'), 3),
 (5, 'Игрок', 2, 1, Decimal('480.50'), 10),
 (6, 'Стихотворения и поэмы', 3, 2, Decimal('650.00'), 15),
 (7, 'Черный человек', 3, 2, Decimal('570.20'), 12),
 (8, 'Лирика', 4, 2, Decimal('518.99'), 2)]

In [17]:
%%sql
UPDATE supply
SET price = 380.80, amount = 4
WHERE supply_id = 1;

UPDATE supply
SET amount = 0
WHERE supply_id IN (2, 3, 4);

SELECT * FROM supply;

 * mysql://root:***@localhost/mydb
1 rows affected.
3 rows affected.
6 rows affected.

[(1, 'Доктор Живаго', 'Пастернак Б.Л.', Decimal('380.80'), 4),
 (2, 'Черный человек', 'Есенин С.А.', Decimal('570.20'), 0),
 (3, 'Белая гвардия', 'Булгаков М.А.', Decimal('540.50'), 0),
 (4, 'Идиот', 'Достоевский Ф.М.', Decimal('360.80'), 0),
 (5, 'Стихотворения и поэмы', 'Лермонтов М.Ю.', Decimal('255.90'), 4),
 (6, 'Остров сокровищ', 'Стивенсон Р.Л.', Decimal('599.99'), 5)]

Добавить новые книги из таблицы **supply** в таблицу **book** на основе сформированного выше запроса. Затем вывести для просмотра таблицу **book**.

**Пояснение:**
Если нужно оставить какое-то поле пустым - его просто не указывают в списке полей таблицы, в которую добавляются записи.

In [18]:
%%sql
INSERT INTO book(title, author_id, price, amount)
SELECT title, author_id, price, amount
FROM 
    author 
    INNER JOIN supply ON author.name_author = supply.author
WHERE amount <> 0;

SELECT * FROM book;

 * mysql://root:***@localhost/mydb
3 rows affected.
11 rows affected.

[(1, 'Мастер и Маргарита', 1, 1, Decimal('670.99'), 3),
 (2, 'Белая гвардия', 1, 1, Decimal('540.50'), 12),
 (3, 'Идиот', 2, 1, Decimal('437.11'), 13),
 (4, 'Братья Карамазовы', 2, 1, Decimal('799.01'), 3),
 (5, 'Игрок', 2, 1, Decimal('480.50'), 10),
 (6, 'Стихотворения и поэмы', 3, 2, Decimal('650.00'), 15),
 (7, 'Черный человек', 3, 2, Decimal('570.20'), 12),
 (8, 'Лирика', 4, 2, Decimal('518.99'), 2),
 (9, 'Доктор Живаго', 4, None, Decimal('380.80'), 4),
 (10, 'Стихотворения и поэмы', 5, None, Decimal('255.90'), 4),
 (11, 'Остров сокровищ', 6, None, Decimal('599.99'), 5)]

## 2.3.5 Запрос на обновление, вложенные запросы

Актуализируем таблицы **book**.

In [19]:
%%sql
UPDATE book
SET genre_id = 1
WHERE book_id = 9;

 * mysql://root:***@localhost/mydb
1 rows affected.

[]

 Занести для книги «Стихотворения и поэмы» Лермонтова жанр «Поэзия», а для книги «Остров сокровищ» Стивенсона - «Приключения». (Использовать два запроса).

In [22]:
%%sql
UPDATE book
SET genre_id = 
      (
       SELECT genre_id 
       FROM genre 
       WHERE name_genre = 'Поэзия'
      )
WHERE book_id = 10;

UPDATE book
SET genre_id = 
      (
       SELECT genre_id 
       FROM genre 
       WHERE name_genre = 'Приключения'
      )
WHERE book_id = 11;

SELECT * FROM book;

 * mysql://root:***@localhost/mydb
1 rows affected.
1 rows affected.
11 rows affected.

[(1, 'Мастер и Маргарита', 1, 1, Decimal('670.99'), 3),
 (2, 'Белая гвардия', 1, 1, Decimal('540.50'), 12),
 (3, 'Идиот', 2, 1, Decimal('437.11'), 13),
 (4, 'Братья Карамазовы', 2, 1, Decimal('799.01'), 3),
 (5, 'Игрок', 2, 1, Decimal('480.50'), 10),
 (6, 'Стихотворения и поэмы', 3, 2, Decimal('650.00'), 15),
 (7, 'Черный человек', 3, 2, Decimal('570.20'), 12),
 (8, 'Лирика', 4, 2, Decimal('518.99'), 2),
 (9, 'Доктор Живаго', 4, 1, Decimal('380.80'), 4),
 (10, 'Стихотворения и поэмы', 5, 2, Decimal('255.90'), 4),
 (11, 'Остров сокровищ', 6, 3, Decimal('599.99'), 5)]

## 2.3.6 Каскадное удаление записей связанных таблиц

Удалить всех авторов и все их книги, общее количество книг которых меньше 20.

In [23]:
%%sql
DELETE FROM
    author
WHERE
    author_id IN (
        SELECT author_id
        FROM book
        GROUP BY author_id
        HAVING SUM(amount) < 20);

 * mysql://root:***@localhost/mydb
4 rows affected.

[]

In [24]:
%%sql
SELECT * FROM author;

 * mysql://root:***@localhost/mydb
2 rows affected.

[(2, 'Достоевский Ф.М.'), (3, 'Есенин С.А.')]

In [25]:
%%sql
SELECT * FROM book;

 * mysql://root:***@localhost/mydb
5 rows affected.

[(3, 'Идиот', 2, 1, Decimal('437.11'), 13),
 (4, 'Братья Карамазовы', 2, 1, Decimal('799.01'), 3),
 (5, 'Игрок', 2, 1, Decimal('480.50'), 10),
 (6, 'Стихотворения и поэмы', 3, 2, Decimal('650.00'), 15),
 (7, 'Черный человек', 3, 2, Decimal('570.20'), 12)]

## 2.3.7 Удаление записей главной таблицы с сохранением записей в зависимой

Актуализируем таблицы:

In [54]:
%%sql
DELETE FROM author;
ALTER TABLE author AUTO_INCREMENT = 1;

INSERT INTO author (name_author)
VALUES
    ('Булгаков М.А.'),
    ('Достоевский Ф.М.'),
    ('Есенин С.А.'),
    ('Пастернак Б.Л.'),
    ('Лермонтов М.Ю.'),
    ('Стивенсон Р.Л.');

SELECT * FROM author;

 * mysql://root:***@localhost/mydb
6 rows affected.
0 rows affected.
6 rows affected.
6 rows affected.

[(1, 'Булгаков М.А.'),
 (2, 'Достоевский Ф.М.'),
 (3, 'Есенин С.А.'),
 (4, 'Пастернак Б.Л.'),
 (5, 'Лермонтов М.Ю.'),
 (6, 'Стивенсон Р.Л.')]

In [55]:
%%sql
DELETE FROM genre;
ALTER TABLE genre AUTO_INCREMENT = 1;

INSERT INTO genre(name_genre)
VALUES ('Роман'),
       ('Поэзия'),
       ('Приключения');

SELECT * FROM genre;

 * mysql://root:***@localhost/mydb
2 rows affected.
0 rows affected.
3 rows affected.
3 rows affected.

[(1, 'Роман'), (2, 'Поэзия'), (3, 'Приключения')]

In [59]:
%%sql
DELETE FROM book;
ALTER TABLE book AUTO_INCREMENT = 1;

INSERT INTO book(title, author_id, genre_id, price, amount)
VALUES
    ('Мастер и Маргарита', 1, 1, 670.99, 3),
    ('Белая гвардия', 1, 1, 540.50, 12),
    ('Идиот', 2, 1, 437.11, 13),
    ('Братья Карамазовы', 2, 1, 799.01, 3),
    ('Игрок', 2, 1, 480.50, 10),
    ('Стихотворения и поэмы', 3, 2, 650.00, 15),
    ('Черный человек', 3, 2, 570.20, 12),
    ('Лирика', 4, 2, 518.99, 2),
    ('Доктор Живаго', 4, 1, 380.80, 4),
    ('Стихотворения и поэмы', 5, 2, 255.90, 4),
    ('Остров сокровищ', 6, 3, 599.99, 5);

SELECT * FROM book;

 * mysql://root:***@localhost/mydb
0 rows affected.
0 rows affected.
11 rows affected.
11 rows affected.

[(1, 'Мастер и Маргарита', 1, 1, Decimal('670.99'), 3),
 (2, 'Белая гвардия', 1, 1, Decimal('540.50'), 12),
 (3, 'Идиот', 2, 1, Decimal('437.11'), 13),
 (4, 'Братья Карамазовы', 2, 1, Decimal('799.01'), 3),
 (5, 'Игрок', 2, 1, Decimal('480.50'), 10),
 (6, 'Стихотворения и поэмы', 3, 2, Decimal('650.00'), 15),
 (7, 'Черный человек', 3, 2, Decimal('570.20'), 12),
 (8, 'Лирика', 4, 2, Decimal('518.99'), 2),
 (9, 'Доктор Живаго', 4, 1, Decimal('380.80'), 4),
 (10, 'Стихотворения и поэмы', 5, 2, Decimal('255.90'), 4),
 (11, 'Остров сокровищ', 6, 3, Decimal('599.99'), 5)]

In [57]:
%%sql
DELETE FROM supply;
ALTER TABLE supply AUTO_INCREMENT = 1;

INSERT INTO
    supply (title, author, price, amount)
VALUES
    ('Доктор Живаго', 'Пастернак Б.Л.', 380.80, 4),
    ('Черный человек', 'Есенин С.А.', 570.20, 6),
    ('Белая гвардия', 'Булгаков М.А.', 540.50, 7),
    ('Идиот', 'Достоевский Ф.М.', 360.80, 3),
    ('Стихотворения и поэмы', 'Лермонтов М.Ю.', 255.90, 4),
    ('Остров сокровищ', 'Стивенсон Р.Л.', 599.99, 5);

SELECT * FROM supply;

 * mysql://root:***@localhost/mydb
6 rows affected.
0 rows affected.
6 rows affected.
6 rows affected.

[(1, 'Доктор Живаго', 'Пастернак Б.Л.', Decimal('380.80'), 4),
 (2, 'Черный человек', 'Есенин С.А.', Decimal('570.20'), 6),
 (3, 'Белая гвардия', 'Булгаков М.А.', Decimal('540.50'), 7),
 (4, 'Идиот', 'Достоевский Ф.М.', Decimal('360.80'), 3),
 (5, 'Стихотворения и поэмы', 'Лермонтов М.Ю.', Decimal('255.90'), 4),
 (6, 'Остров сокровищ', 'Стивенсон Р.Л.', Decimal('599.99'), 5)]

Удалить все жанры, к которым относится меньше 4-х книг. В таблице **book** для этих жанров установить значение Null.

In [52]:
%%sql
DELETE FROM
    genre
WHERE
    genre_id IN (
        SELECT genre_id
        FROM book
        GROUP BY genre_id
        HAVING COUNT(title) < 4);

 * mysql://root:***@localhost/mydb
1 rows affected.

[]

In [53]:
%%sql
SELECT * FROM book;

 * mysql://root:***@localhost/mydb
11 rows affected.

[(1, 'Мастер и Маргарита', 1, 1, Decimal('670.99'), 3),
 (2, 'Белая гвардия', 1, 1, Decimal('540.50'), 12),
 (3, 'Идиот', 2, 1, Decimal('437.11'), 13),
 (4, 'Братья Карамазовы', 2, 1, Decimal('799.01'), 3),
 (5, 'Игрок', 2, 1, Decimal('480.50'), 10),
 (6, 'Стихотворения и поэмы', 3, 2, Decimal('650.00'), 15),
 (7, 'Черный человек', 3, 2, Decimal('570.20'), 12),
 (8, 'Лирика', 4, 2, Decimal('518.99'), 2),
 (9, 'Доктор Живаго', 4, 1, Decimal('380.80'), 4),
 (10, 'Стихотворения и поэмы', 5, 2, Decimal('255.90'), 4),
 (11, 'Остров сокровищ', 6, None, Decimal('599.99'), 5)]

## 2.3.8 Удаление записей, использование связанных таблиц

Удалить всех авторов, которые пишут в жанре "Поэзия". Из таблицы **book** удалить все книги этих авторов. В запросе для отбора авторов использовать полное название жанра, а не его **id**.

In [62]:
%%sql
DELETE FROM author
USING 
    genre
    INNER JOIN book
    USING(genre_id)
    INNER JOIN author
    USING(author_id)
WHERE
    genre.name_genre = 'Поэзия';

 * mysql://root:***@localhost/mydb
3 rows affected.

[]

In [63]:
%%sql
SELECT * FROM author;

 * mysql://root:***@localhost/mydb
3 rows affected.

[(1, 'Булгаков М.А.'), (2, 'Достоевский Ф.М.'), (6, 'Стивенсон Р.Л.')]

In [64]:
%%sql
SELECT * FROM book;

 * mysql://root:***@localhost/mydb
6 rows affected.

[(1, 'Мастер и Маргарита', 1, 1, Decimal('670.99'), 3),
 (2, 'Белая гвардия', 1, 1, Decimal('540.50'), 12),
 (3, 'Идиот', 2, 1, Decimal('437.11'), 13),
 (4, 'Братья Карамазовы', 2, 1, Decimal('799.01'), 3),
 (5, 'Игрок', 2, 1, Decimal('480.50'), 10),
 (11, 'Остров сокровищ', 6, 3, Decimal('599.99'), 5)]